#+TITLE: Portfolio Management with R
#+AUTHOR: Enrico Schumann
#+BIND: org-latex-default-packages-alist nil
#+BIND: org-use-sub-superscripts {}
#+PROPERTY: tangle yes
# ------------------ LATEX ------------------
#+LATEX_CLASS: scrbook
#+LATEX_HEADER: \addtokomafont{disposition}{\rmfamily}
#+LATEX_HEADER: \addtokomafont{descriptionlabel}{\rmfamily}
#+LATEX_HEADER: \usepackage[backend=bibtex,citestyle=authoryear]{biblatex}
#+LATEX_HEADER: \addbibresource{Library.bib}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \setmainfont{EB Garamond}
#+LATEX_HEADER: \setmonofont[Scale=0.91]{inconsolata}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \lstset{language=R,basicstyle=\ttfamily,frame=single,
#+LATEX_HEADER:         numberstyle=\ttfamily\footnotesize\color{gray}}
#+LATEX_HEADER: \usepackage{mdframed}
#+LATEX_HEADER: \usepackage{hyperref}
#+PROPERTY: header-args:R :session *R*

#+BEGIN_SRC R :exports none :results none
options(continue = " ", digits = 3, width = 60, useFancyQuotes = FALSE)
require("PMwR")
require("zoo")
#+END_SRC



** Exposure

We have the following trades and times.

#+BEGIN_SRC R -n :exports code :results none
amount <- c(1,3,-3,1,-3,1)
time <- c(0,1,3,4,7,12)
#+END_SRC

The holding period (duration) of these trades can be computed
so:
#+BEGIN_SRC R -n :exports both :colnames yes :results output
data.frame(position = cumsum(amount)[-length(amount)], 
           from = time[-length(time)],
           to   = time[-1L],
           duration = diff(time))
#+END_SRC

#+RESULTS:
:   position from to duration
: 1        1    0  1        1
: 2        4    1  3        2
: 3        1    3  4        1
: 4        2    4  7        3
: 5       -1    7 12        5


We can plot the exposure.

#+BEGIN_SRC R -n :results graphics :file exposure.pdf :width 4 :height 3 :exports both
par(bty = "n", mar = c(4, 4, 0, 0), tck = 0.005, 
    las = 1, cex = 0.8)
plot(c(time[1], time), cumsum(c(0, amount)), 
     type = "s", xlab = "time", ylab = "position")
#+END_SRC

#+RESULTS:
[[file:exposure.pdf]]

Thus, we have had a position from time zero to 12 (hours into the
trading day, say), but its size varied.  The function
=twExposure= (time-weighted exposure) computes the average
absolute exposure.
#+BEGIN_SRC R -n :exports both
twExposure(amount, time)
#+END_SRC

#+RESULTS:
: 1.75

To give a simple example: suppose we bought at the open of a trading
day and sold at noon.  The average exposure for the day is thus half a
contract.

#+BEGIN_SRC R -n :exports both
amount <- c(1, -1 , 0)
time   <- c(0,0.5,1)
twExposure(amount, time)
#+END_SRC

#+RESULTS:
: 0.5

 


** Splitting and rescaling

Suppose we have the following trades and impose a limit that the
maximum absolute exposure for the trader should only be 2.


#+BEGIN_SRC R -n :exports both :results output
t <- 1:6
n <- c(-1,-1,-1,1,1,1)
p <- c(100,99,98,98,99,100)
limit(n, p, t, lim = 2)
#+END_SRC

#+RESULTS:
: $amount
: [1] -1 -1  1  1
: 
: $price
: [1] 100  99  99 100
: 
: $timestamp
: [1] 1 2 5 6


Scaling the trades.

#+BEGIN_SRC R -n :exports both :results output
scaleToUnity(n)
#+END_SRC

#+RESULTS:
: [1] -0.3333333 -0.3333333 -0.3333333  0.3333333  0.3333333  0.3333333

Closing the trade at once.
#+BEGIN_SRC R -n :exports both :results output
closeOnFirst(n)
#+END_SRC

#+RESULTS:
: [1] -1 -1 -1  3  0  0


